#1
# Користувач вводить число n
n = int(input("Введіть число n: "))

# Створюємо кортеж зі списку чисел
numbers = tuple([1, 5, 10, 15, 20, 25, 30])

# Створюємо новий список result за допомогою генератора списків
result = [x for x in numbers if x < n]

# Виводимо результат
print("Числа менші за", n, ":", result)

#2
# Створюємо кортеж з трьох рядків
tuple_of_strings = ("Рядок1", "Рядок2", "Рядок3")

# З'єднуємо рядки в один рядок з комою як роздільником
result_string = ', '.join(tuple_of_strings)

# Виводимо результат
print(result_string)

#3
# Створення словника про книги в бібліотеці
library = {
    "Книга1": {"Автор": "Автор1", "Рік": 2020, "Сторінки": 300},
    "Книга2": {"Автор": "Автор2", "Рік": 2018, "Сторінки": 250},
    "Книга3": {"Автор": "Автор3", "Рік": 2019, "Сторінки": 200},
}

# Введення користувача
назва_книги = input("Введіть назву книги: ")

# Перевірка, чи існує книга в словнику
if назва_книги in library:
    # Виведення інформації про книгу
    print(f"Інформація про книгу '{назва_книги}':")
    for key, value in library[назва_книги].items():
        print(f"{key}: {value}")
else:
    print(f"Книга з назвою '{назва_книги}' не знайдена в бібліотеці.")

#4
students = {
    'Петров': ('Іван', 20, 'Фізика'),
    'Сидоров': ('Олександр', 22, 'Математика'),
    'Іванов': ('Анна', 21, 'Хімія')
}

прізвище_студента = input('Введіть прізвище студента: ')
if прізвище_студента in students:
    ім_я, вік, спеціальність = students[прізвище_студента]
    print(f"Студент: {прізвище_студента}, Ім'я: {ім_я}, Вік: {вік}, Спеціальність: {спеціальність}")
else:
    print("Інформація про цього студента відсутня")

#5
def додати_номер(телефонна_книга, ім_я, новий_номер):
    """Додає новий номер телефону до списку номерів контакту."""
    if ім_я in телефонна_книга:
        телефонна_книга[ім_я].append(новий_номер)
    else:
        телефонна_книга[ім_я] = [новий_номер]

# Створення початкового словника з номерами телефонів
телефонна_книга = {
    'Анна': ['123-456-789', '987-654-321'],
    'Петро': ['555-555-555'],
    'Марія': ['111-222-333', '444-555-666']
}

# Додавання нового номера для контакту 'Анна'
додати_номер(телефонна_книга, 'Анна', '111-111-111')

# Додавання нового номера для контакту 'Ігор'
додати_номер(телефонна_книга, 'Ігор', '999-888-777')

# Виведення всіх номерів телефону для всіх контактів
for ім_я, номера in телефонна_книга.items():
    print(f"{ім_я}: {', '.join(номера)}")